<a href="https://colab.research.google.com/github/SowjanyaKiran/SQLite3/blob/main/SQLite3_through_colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Introduction to SQL and Advanced Queries**

In [ ]:
#Importing SQLite3 libraries
import sqlite3

In [ ]:
#Connecting SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [ ]:
# Create Table
# CREATE TABLE TABLE_NAME
cursor.execute('''
CREATE TABLE students (
  id INTEGER PRIMARY KEY,
  name TEXT,
  age INTEGER,
  grade TEXT
)
''')

In [ ]:
# Insert Data to the Table
#INSERT INTO TABLE_NAME(COLUMN1, COLUMN2,...COLUMNn) VALUES (VALUE1,VALUE2,...VALUEn)
cursor.execute('''
INSERT INTO students (name, age, grade) VALUES ('John Doe', 21, 'A')
''')

In [ ]:
#Inserting data in table
cursor.execute('''
INSERT INTO students (name, age, grade) VALUES ('Jane Smith', 22, 'B')
''')
cursor.execute('''
INSERT INTO students (name, age, grade) VALUES  ('Ravi', 20, 'B')
''')
cursor.execute('''
INSERT INTO students (name, age, grade) VALUES  ('Raja', 23, 'C')
''')

In [ ]:
#Commit the changes
conn.commit()

In [ ]:
#Display the data in table
cursor.execute('''
SELECT * FROM students
''')

In [ ]:
rows = cursor.fetchall()

In [ ]:
for row in rows:
  print(row)

(1, 'John Doe', 21, 'A')
(2, 'Jane Smith', 22, 'B')
(3, 'Ravi', 20, 'B')
(4, 'Raja', 23, 'C')

In [ ]:
#Delete recod were name is John Doe
cursor.execute('''
DELETE FROM students WHERE name = 'Raja'
''')

In [ ]:
#Commit the changes
conn.commit()

In [ ]:
#Display the data in table
cursor.execute('''
SELECT * FROM students
''')

In [ ]:
for row in rows:
  print(row)

(1, 'John Doe', 21, 'A')
(2, 'Jane Smith', 22, 'B')
(3, 'Ravi', 20, 'B')
(4, 'Raja', 23, 'C')

In [ ]:
# Update record with age 30 where name is ravi
# UPDATE TABLE_NAME SET FIELD_NAME= VALUE WHERE CONDITION
cursor.execute('''
UPDATE students SET age = 30 WHERE name = 'Ravi'
''')

In [ ]:
# Commit the changes
conn.commit()

In [ ]:
# Display the update DB
cursor.execute('''
SELECT * FROM students
''')

In [ ]:
rows = cursor.fetchall()
for row in rows:
  print(row)

(1, 'John Doe', 21, 'A')
(2, 'Jane Smith', 22, 'B')
(3, 'Ravi', 30, 'B')

In [ ]:
# Create a Table Name courses with features, id and course_name
cursor.execute('''
CREATE TABLE courses (
  id INTEGER PRIMARY KEY,
  course_name TEXT
)
''')

In [ ]:
# Add 3 records with values Mathematics, Physics and Physics
# Insert Data to the Table
#INSERT INTO TABLE_NAME(COLUMN1, COLUMN2,...COLUMNn) VALUES (VALUE1,VALUE2,...VALUEn)
cursor.execute('''
INSERT INTO courses (course_name) VALUES ('Mathematics')
''')
cursor.execute('''
INSERT INTO courses (course_name) VALUES ('Physics')
''')
cursor.execute('''
INSERT INTO courses (course_name) VALUES ('Physics')
''')

In [ ]:
# Commit the changes
conn.commit()

In [ ]:
# Display the update DB
cursor.execute('''
SELECT * FROM courses
''')

In [ ]:
rows = cursor.fetchall()
for row in rows:
  print(row)

(1, 'Mathematics')
(2, 'Physics')
(3, 'Physics')

In [ ]:
# JOIN BOTH THE TABLES
cursor.execute('''
SELECT students.name, courses.course_name
FROM students
JOIN courses ON students.id = courses.id
''')

In [ ]:
# Commit the changes
conn.commit()

In [ ]:
rows = cursor.fetchall()
for row in rows:
  print(row)

('John Doe', 'Mathematics')
('Jane Smith', 'Physics')
('Ravi', 'Physics')

In [ ]:
# Count the occurance of Mathematics and Physics
cursor.execute('''
SELECT courses.course_name, COUNT(*) AS count
FROM students
JOIN courses ON students.id = courses.id
GROUP BY courses.course_name

''')

In [ ]:
# Commit the changes
conn.commit()

In [ ]:
rows = cursor.fetchall()
for row in rows:
  print(row)

('Mathematics', 1)
('Physics', 2)

In [ ]:
# Grouping data and using aggregate functions

cursor.execute('''
SELECT courses.course_name, COUNT(*) as student_count
FROM courses
JOIN students ON courses.id = students.id
GROUP BY courses.course_name
''')

In [ ]:
rows = cursor.fetchall()
print("\nGrouped Data:")
for row in rows:
    print(row)

Grouped Data:
('Mathematics', 1)
('Physics', 2)

In [ ]:
# ORDER BY GRADE FROM STUDENT TABLE IN DESCENDING ORDER
cursor.execute('''SELECT name,grade
FROM students ORDER BY grade DESC
''')
rows = cursor.fetchall()
print("\nGrouped Data:")
for row in rows:
    print(row)

Grouped Data:
('Jane Smith', 'B')
('Ravi', 'B')
('John Doe', 'A')